"""
Условия:
    1) Вывести на экран данные полученные из файла второй задачи(
    экспортировав функцию из второго задания)

    2) Создать функцию get_symbols, которая должна принимать на вход значение с данными из файла первой задачи.
    Ко всем элементам, кроме итогов нужно применить встроенную функцию chr(x), где x - это наш элемент из таблицы.
    Получив символ по его номеру, мы записываем полученный символ вместо этого номера(вместо элемента).
    Полученный результат функция должна вернуть.

    3) Создать функцию aggregate_it, которая должна принимать на вход значение с данными из файла второй задачи.
    По каждой строке в файле сделать следующие преобразования, из 11 столбцов должно получиться 2.
    Где в первый столбец записывается текст, в который первая часть состоит из всех букв этой строки, и вторая часть
    из всех чисел. Все объединённое в одном слово.
    А второй столбец это "итого" оставшиеся без изменений
    Измененные данные должны быть возвращены этой функцией.

    4) Результат функции aggregate_it сохранить в отдельный файл "Матрица 3.txt"

    5) Вывести на экран значения Матрицы 3

    Сопроводить все действия логирование.(делать print с информативными данными о том,
    какой процесс сейчас происходит)

"""
# Твой код:
from task2 import read_f

matrix_2 = read_f("Матрица_2.txt")
matrix = read_f("Матрица.txt")

def get_symbols(datas: str) -> str:
    result = ''
    rows = datas.split("\n")
    for row in rows:
        s = ''
        for num in row.split("\t"):
            s += chr(int(num)) + "\t"
        result += s + "\n"
    return result[0:-1]



def aggregate_it(matrix: str) -> str:
    itog = ""
    for row in matrix.split("\n"):
        str_num = ""
        strochka_letter = ""
        str_sum = 0
        for elem in row.split("\t"):
            if elem.isnumeric():
                str_num += elem
                str_sum += int(elem)
            else:
                strochka_letter += elem
        result = strochka_letter + str_num
        itog += result +"\t"+ str(str_sum) + "\n"

    return itog[:-1]







v = get_symbols(matrix)
z = aggregate_it(v)
with open("Матрица_3.txt", "w", encoding="utf_8") as file:
    file.write(z)



