from sympy import Symbol, diff

# Определение переменной x
x = Symbol('x')

# Определение функции f(x)
f = 3.7*x**4+11/(0.06+x**2)
beta = float(0.1)
# Вычисление производной функции f в точке x=1
df_dx = diff(f, x)
d2f_dx2 = diff(df_dx, x)
print("Производная функции f(x) в точке x=1 равна", d2f_dx2.subs({x: -1.049804687001953}))
print("Производная функции f(x) в точке x=1 равна", d2f_dx2.subs({x: -1.049804687001953+beta}))



#Производная функции f(x) в точке x=1 равна -0.000203276128647900
#Производная функции f(x) в точке x=1 равна -0.0211001356771483